Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ལ་སྤྱོད་པ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what is (75) the meditative stability named engaging in conduct, abiding in that meditative stability, one observes the conduct associated with all meditative stabilities.

source: འདི་ནི་སྤྱོད་པ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named engaging in conduct.

source: །དེ་ལ་གཡོ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་གཡོ་བ་མེད་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་སྟེ།
en: If you ask what is (76) the meditative stability named unwavering, abiding in that meditative stability, one observes that all meditative stabilities are unwavering.

source: འདི་ནི་གཡོ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ། །དེ་ལ་ཡུལ་ལས་རྒལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་ལས་ཡང་དག་པར་འདའ་བ་སྟེ།
en: This is the meditative stability named unwavering, {Dt.202} If you ask what is (77) the meditative stability named transcendence of the range, abiding in that meditative stability, one transcends the perceptual range of all meditative stabilities.

source: འདི་ནི་ཡུལ་ལས་རྒལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named transcendence of the range.

source: །དེ་ལ་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་ཚོགས་སུ་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་ཐམས་ཅད་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་གྱི་ཚོགས་རྗེས་སུ་འཐོབ་པ་སྟེ།
en: If you ask what is (78) the meditative stability named accumulation of all attributes, abiding in that meditative stability, one subsequently acquires the accumulation of attributes associated with all phenomena and all meditative stabilities.

source: འདི་ནི་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་ཚོགས་སུ་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named accumulation of all attributes.

source: །དེ་ལ་སེམས་མེད་པར་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སེམས་མི་འཇུག་པ་སྟེ།
en: If you ask what is (79) the meditative stability named abiding without mentation, abiding in that meditative stability, one does not engage mentally with any meditative stabilities.

source: འདི་ནི་སེམས་མེད་པར་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named abiding without mentation.

source: །དེ་ལ་དགེ་བའི་མེ་ཏོག་རྒྱས་ཤིང་གསལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་དགེ་བའི་མེ་ཏོག་རྒྱས་ཤིང་གསལ་བ་རབ་ཏུ་འཐོབ་པ་སྟེ།
en: If you ask what is (80) the meditative stability named blossoming and vibrance of the flowers of virtue, abiding in that meditative stability, one acquires the blossoming and vibrancy of the flowers of virtue with respect to all meditative stabilities.

source: འདི་ནི་དགེ་བའི་མེ་ཏོག་རྒྱས་ཤིང་གསལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named blossoming and vibrance of the flowers of virtue.

source: །དེ་ལ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རབ་ཏུ་འཐོབ་པ་སྟེ།
en: If you ask what is (81) the meditative stability named endowed with the factors conducive to enlightenment, abiding in that meditative stability, one acquires the factors conducive to enlightenment with respect to all meditative stabilities.

source: འདི་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named endowed with the factors conducive to enlightenment.

source: །དེ་ལ་སྤོབས་པ་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སྤོབས་པ་མཐའ་ཡས་པ་རབ་ཏུ་འཐོབ་པ་སྟེ།
en: If you ask what is (82) the meditative stability named boundless eloquence, abiding in that meditative stability, one acquires boundless eloquence with respect to all meditative stabilities.

source: འདི་ནི་སྤོབས་པ་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named boundless eloquence.

source: །དེ་ལ་མི་མཉམ་པ་དང་མཉམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་མི་མཉམ་པ་དང་མཉམ་པ་རབ་ཏུ་འཐོབ་པ་སྟེ།
en: If you ask what is (83) the meditative stability named equal to the unequaled, abiding in that meditative stability, one acquires the state of being equal to the unequaled with respect to all meditative stabilities.

source: འདི་ནི་མི་མཉམ་པ་དང་མཉམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named equal to the unequaled.

source: །དེ་ལ་ཆོས་ཐམས་ཅད་ལས་འདའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་ཁམས་གསུམ་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་བ་སྟེ།
en: If you ask what is (84) the meditative stability named transcending all phenomena, abiding in that meditative stability, one transcends all the three realms.

source: འདི་ནི་ཆོས་ཐམས་ཅད་ལས་འདའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named transcending all phenomena.

source: །དེ་ལ་ཡོངས་སུ་གཅོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་ཐམས་ཅད་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་རྒྱུད་མཐོང་བ་སྟེ།
en: If you ask what is (85) the meditative stability named utterly devoid of delimitation, abiding in that meditative stability, one discerns the continuum of all phenomena and of all meditative stabilities.

source: འདི་ནི་ཡོངས་སུ་གཅོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named utterly devoid of delimitation.

source: །དེ་ལ་ནེམ་ནུར་རྣམ་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། ཆོས་ཐམས་ཅད་ལ་ནེམ་ནུར་རྣམ་པར་སེལ་བ་རབ་ཏུ་འཐོབ་པ་སྟེ།
en: If you ask what is (86) the meditative stability named dispelling of doubt, abiding in that meditative stability, one acquires the dispelling of doubt with respect to all meditative stabilities and all phenomena.

source: འདི་ནི་ནེམ་ནུར་རྣམ་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named dispelling of doubt.

source: །དེ་ལ་གནས་སུ་བྱ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་ཐམས་ཅད་ཀྱི་གནས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what is (87) the meditative stability named without settled focus, abiding in that meditative stability, one does not observe a settled focus with respect to any phenomena.

source: འདི་ནི་གནས་སུ་བྱ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named without settled focus.

source: །དེ་ལ་གཅིག་ཏུ་རྣམ་པར་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་གང་ཡང་གཉིས་སུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what is (88) the meditative stability named single array, abiding in that meditative stability, one does not observe anything at all in terms of duality.

source: འདི་ནི་གཅིག་ཏུ་རྣམ་པར་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named single array.

source: །དེ་ལ་རྣམ་པ་མངོན་པར་སྒྲུབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་ཐམས་ཅད་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་རྣམ་པ་མངོན་པར་སྒྲུབ་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what is (89) the meditative stability named manifest attainment of aspects, abiding in that meditative stability, one acquires the manifest attainment of all phenomena and of all meditative stabilities.

source: འདི་ནི་རྣམ་པ་མངོན་པར་སྒྲུབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named manifest attainment of aspects.

source: །དེ་ལ་རྣམ་པ་གཅིག་ཏུ་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་རྣམ་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what is (90) the meditative stability named unity, abiding in that meditative stability, one does not observe the aspects of any meditative stabilities.

source: འདི་ནི་རྣམ་པ་གཅིག་ཏུ་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named unity.

source: །དེ་ལ་རྣམ་པ་འདོར་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་གཉིས་སུ་མེད་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་སྟེ།
en: If you ask what is (91) the meditative stability named nonexclusion, abiding in that meditative stability, one does not observe any meditative stabilities in terms of nonduality.

source: འདི་ནི་རྣམ་པ་འདོར་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named nonexclusion.

source: །དེ་ལ་རྟོགས་པས་སྲིད་པའི་གཞི་ཐམས་ཅད་ཁོང་དུ་ཆུད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་རྟོགས་པར་བྱེད་པའི་ཡེ་ཤེས་ལ་ཞུགས་ནས། དེ་ལ་ཞུགས་པའི་ཕྱིར་ཁོང་དུ་མི་ཆུད་པ་གང་ཡང་མེད་པ་སྟེ།
en: If you ask what is (92) the meditative stability named comprehension of all bases of rebirth through realization, abiding in that meditative stability, one enters into the wisdom that realizes all meditative stabilities and then, since that has been entered, there is nothing at all that has not been comprehended.

source: འདི་ནི་རྟོགས་པས་སྲིད་པའི་གཞི་ཐམས་ཅད་ཁོང་དུ་ཆུད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named comprehension of all bases of rebirth through realization.

source: །དེ་ལ་བརྡ་དང་སྒྲ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་བརྡ་དང་སྒྲ་ལ་འཇུག་པ་སྟེ།
en: If you ask what is (93) the meditative stability named entrance to symbols and sounds, abiding in that meditative stability, one enters into the symbols and sounds associated with all meditative stabilities.

source: འདི་ནི་བརྡ་དང་སྒྲ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named entrance to symbols and sounds.

source: །དེ་ལ་སྒྲ་དབྱངས་ཀྱི་ཡི་གེ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཡི་གེ་དང་བྲལ་བར་རྗེས་སུ་མཐོང་བ་སྟེ།
en: If you ask what is (94) the meditative stability named devoid of vocalic syllables, abiding in that meditative stability, one discerns that all meditative stabilities are devoid of syllables.

source: འདི་ནི་སྒྲ་དབྱངས་ཀྱི་ཡི་གེ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named devoid of vocalic syllables.

source: །དེ་ལ་སྒྲོན་མ་འབར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་གཟི་བརྗིད་ཀྱིས་ལྷམ་མེ། ལྷན་ནེ།
en: If you ask what is (95) the meditative stability named burning lamp, abiding in that meditative stability, one illuminates, heats, and bedazzles all meditative stabilities with splendor.

source: ལྷང་ངེར་བྱེད་པ་སྟེ། འདི་ནི་སྒྲོན་མ་འབར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named burning lamp.

source: །དེ་ལ་མཚན་ཉིད་ཡོངས་སུ་སྦྱོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་ཡོངས་སུ་དག་པར་འགྱུར་བར་བྱེད་པ་སྟེ།
en: If you ask what is (96) the meditative stability named purification of defining characteristics, abiding in that meditative stability, one purifies the defining characteristics of all meditative stabilities.

source: འདི་ནི་མཚན་ཉིད་ཡོངས་སུ་སྦྱོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named purification of defining characteristics.

source: །དེ་ལ་མངོན་པར་དམིགས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་མངོན་པར་དམིགས་པ་མེད་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་སྟེ།
en: If you ask what is (97) the meditative stability named manifestly nonperceived, abiding in that meditative stability, one observes that all meditative stabilities are manifestly nonapprehensible.

source: །འདི་ནི་མངོན་པར་དམིགས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named manifestly nonperceived.

source: །དེ་ལ་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པར་འགྱུར་བ་སྟེ།
en: If you ask what is (98) the meditative stability named endowed with all finest aspects, abiding in that meditative stability, one becomes endowed with all the finest aspects of all meditative stabilities.

source: འདི་ནི་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named endowed with all finest aspects.

source: །དེ་ལ་བདེ་བ་དང་སྡུག་བསྔལ་ཐམས་ཅད་ལ་མངོན་པར་དགའ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་བདེ་བ་དང་། སྡུག་བསྔལ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what is (99) the meditative stability named absence of joy with respect to all happiness and suffering, abiding in that meditative stability, one does not observe happiness or suffering with respect to any meditative stabilities.

source: འདི་ནི་བདེ་བ་དང་སྡུག་བསྔལ་ཐམས་ཅད་ལ་མངོན་པར་དགའ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named absence of joy with respect to all happiness and suffering. {

source: །དེ་ལ་ཟད་མི་ཤེས་པའི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཟད་དུ་རུང་བར་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་སྟེ།
en: Dt.203} If you ask what is (100) the meditative stability named inexhaustible cornucopia, abiding in that meditative stability, one does not observe that any meditative stabilities are exhaustible.

source: འདི་ནི་ཟད་མི་ཤེས་པའི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named inexhaustible cornucopia.

source: །དེ་ལ་གཟུངས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། གཟུངས་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པ་སྟེ།
en: If you ask what is (101) the meditative stability named dhāraṇī intelligence, abiding in that meditative stability, one apprehends all modes of dhāraṇī.

source: འདི་ནི་གཟུངས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named dhāraṇī intelligence.

source: །དེ་ལ་ཡང་དག་པ་དང་ལོག་པ་ཐམས་ཅད་ཡང་དག་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཡང་དག་པ་དང་ལོག་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what is (102) the meditative stability named complete elimination of right and wrong, abiding in that meditative stability, one does not observe any meditative stabilities in terms of right and wrong.

source: འདི་ནི་ཡང་དག་པ་དང་ལོག་པ་ཐམས་ཅད་ཡང་དག་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named complete elimination of right and wrong.

source: །དེ་ལ་འགལ་བ་དང་འགོག་པ་ཐམས་ཅད་ཡང་དག་པར་ཞི་བར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་འགལ་བ་དང་འགོག་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what is (103) the meditative stability named calming of all deviations and obstacles, abiding in that meditative stability, one does not observe deviations or obstacles with respect to any meditative stabilities.

source: འདི་ནི་འགལ་བ་དང་འགོག་པ་ཐམས་ཅད་ཡང་དག་པར་ཞི་བར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named calming of all deviations and obstacles.

source: །དེ་ལ་འཐུན་པ་དང་འགལ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་འཐུན་པ་དང་འགལ་བ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what is (104) the meditative stability named absence of disharmony, abiding in that meditative stability, one does not observe harmony or disharmony with respect to any meditative stabilities.

source: འདི་ནི་འཐུན་པ་དང་འགལ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named absence of disharmony.

source: །དེ་ལ་འོད་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་མི་དམིགས་པ་སྟེ།
en: If you ask what is (105) the meditative stability named taintless light, abiding in that meditative stability, one does not apprehend the circle of light associated with any meditative stabilities.

source: །དེ་ལ་སྙིང་པོ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྙིང་པོ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what is (106) the meditative stability named endowed with the essence, abiding in that meditative stability, one does not observe the essence of any meditative stabilities.

source: འདི་ནི་སྙིང་པོ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named endowed with the essence.

source: །དེ་ལ་ཟླ་བ་དྲི་མ་མེད་པར་རྒྱས་པའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་འདི་ལྟ་སྟེ། དཔེར་ན་ཟླ་བ་ཉ་བའི་དཀྱིལ་འཁོར་ལྟར་ཡོངས་སུ་རྒྱས་པར་འགྱུར་བ་སྟེ།
en: If you ask what is (107) the meditative stability named taintless light of the full moon, abiding in that meditative stability, one fully develops all meditative stabilities, like the disk of the full moon.

source: འདི་ནི་ཟླ་བ་དྲི་མ་མེད་པར་རྒྱས་པའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named taintless light of the full moon.

source: །དེ་ལ་གློག་གི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། དག་ཅིང་གསལ་བའི་འོད་ཀྱིས་སེམས་ཅན་གྱི་རིས་སྣང་བར་བྱས་ཤིང་། མུན་པ་མུན་ནག་གི་ཚ་བ་གདུག་པ་སེལ་བར་བྱེད་པ་སྟེ།
en: If you ask what is (108) the meditative stability named lightning light, abiding in that meditative stability, one illuminates the realms of beings with pure and radiant light, and dispels the torments of darkest ignorance.

source: འདི་ནི་གློག་གི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named lightning light.

source: །དེ་ལ་རྒྱན་ཆེན་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་རྒྱན་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་བ་སྟེ།
en: If you ask what is (109) the meditative stability named great ornament, abiding in that meditative stability, one becomes endowed with the great ornament of all meditative stabilities.

source: འདི་ནི་རྒྱན་ཆེན་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named great ornament.

source: །དེ་ལ་རྣམ་པ་ཐམས་ཅད་དུ་འོད་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་སྣང་བར་བྱེད་པ་སྟེ།
en: If you ask what is (110) the meditative stability named illuminator of all worlds, abiding in that meditative stability, one illuminates all meditative stabilities.

source: འདི་ནི་རྣམ་པ་ཐམས་ཅད་དུ་འོད་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named illuminator of all worlds.

source: །དེ་ལ་ཏིང་ངེ་འཛིན་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་འཁྲུག་པ་ཡང་མི་དམིགས། རྩེ་གཅིག་ཀྱང་མི་དམིགས་པ་སྟེ།
en: If you ask what is (111) the meditative stability named sameness of meditative stability, abiding in that meditative stability, one does not apprehend agitation in any meditative stability, nor does one apprehend one-pointedness.

source: འདི་ནི་ཏིང་ངེ་འཛིན་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named sameness of meditative stability.

source: །དེ་ལ་རྡུལ་མེད་ཅིང་རྡུལ་དང་བྲལ་བའི་ཚུལ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་དང་ཆོས་ཐམས་ཅད་རྡུལ་ཅན་དང་། རྡུལ་དང་བྲལ་བར་མཉམ་པ་ཉིད་དུ་རྟོགས་པ་སྟེ།
en: If you ask what is (112) the meditative stability named taintless principle devoid of impurities, abiding in that meditative stability, one understands in sameness all meditative stabilities and phenomena that are tainted and those that are untainted.

source: འདི་ནི་རྡུལ་མེད་ཅིང་རྡུལ་དང་བྲལ་བའི་ཚུལ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named taintless principle devoid of impurities.

source: །དེ་ལ་ཉོན་མོངས་པ་མེད་པར་ཡང་དག་པར་གཞོལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཉོན་མོངས་པ་མེད་པར་འགྱུར་བ་སྟེ།
en: If you ask what is (113) the meditative stability named convergence in nonaffliction, abiding in that meditative stability, all one’s meditative stabilities become free from mental afflictions.

source: འདི་ནི་ཉོན་མོངས་པ་མེད་པར་ཡང་དག་པར་གཞོལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named convergence in nonaffliction.

source: །དེ་ལ་ཉོན་མོངས་པ་དང་བཅས་པ་ཐམས་ཅད་ཉོན་མོངས་པ་མེད་པར་ཡང་དག་པར་གཞོལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཉོན་མོངས་པ་དང་བཅས་པ་ཐམས་ཅད་ཉོན་མོངས་པ་མེད་པར་ཡང་དག་པར་གཞོལ་བ་འཐོབ་པར་འགྱུར་བ་སྟེ།
en: If you ask what is (114) the meditative stability named convergence of all mental afflictions in nonaffliction, abiding in that meditative stability, one acquires the convergence of all mental afflictions in nonaffliction.

source: འདི་ནི་ཉོན་མོངས་པ་དང་བཅས་པ་ཐམས་ཅད་ཉོན་མོངས་པ་མེད་པར་ཡང་དག་པར་གཞོལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named convergence of all mental afflictions in nonaffliction.

source: །དེ་ལ་གནས་དམིགས་སུ་མེད་པ་ལ་བརྩོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཀུན་གཞི་ཉེ་བར་མི་དམིགས་པ་སྟེ།
en: If you ask what is (115) the meditative stability named engaging in remaining without an objective support, abiding in that meditative stability, one does not apprehend the basis of any meditative stabilities.

source: འདི་ནི་གནས་དམིགས་སུ་མེད་པ་ལ་བརྩོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ། །དེ་ལ་དེ་བཞིན་ཉིད་ལ་གནས་ཤིང་།
en: This is the meditative stability named engaging in remaining without an objective support.

source: སེམས་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ལས་ཕྱིར་མི་ལྡོག་པ་སྟེ།
en: If you ask what is (116) the meditative stability named abiding in the real nature without mentation, abiding in that meditative stability, one is not diverted from the real nature of all meditative stabilities.

source: འདི་ནི་དེ་བཞིན་ཉིད་ལ་གནས་ཤིང་། སེམས་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named abiding in the real nature without mentation.

source: །དེ་ལ་ལུས་ཀྱི་སྐྱོན་ཡང་དག་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ལུས་མི་དམིགས་པ་སྟེ།
en: If you ask what is (117) the meditative stability named dispelling the misery of corporeality, abiding in that meditative stability, one does not apprehend corporeality with respect to any meditative stability.

source: འདི་ནི་ལུས་ཀྱི་སྐྱོན་ཡང་དག་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named dispelling the misery of corporeality.

source: །དེ་ལ་ངག་གི་སྐྱོན་རྣམ་པར་འཇིག་པས་ནམ་མཁའ་ལྟར་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ངག་གི་ལས་མི་དམིགས་པ་སྟེ།
en: If you ask what is (118) the meditative stability named obliterating defects of speech, transforming them as if into space, abiding in that meditative stability, one does not apprehend verbal actions with respect to any meditative stabilities.

source: འདི་ནི་ངག་གི་སྐྱོན་རྣམ་པར་འཇིག་པས་ནམ་མཁའ་ལྟར་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ། །དེ་ལ་ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་པས།
en: This is the meditative stability named obliterating defects of speech, transforming them as if into space.

source: རྣམ་པར་གྲོལ་ཞིང་གོས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་ཐམས་ཅད་ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་པས། རྣམ་པར་གྲོལ་ཞིང་གོས་པ་མེད་པ་འཐོབ་པ་སྟེ།
en: If you ask what is (119) the meditative stability named unattached, liberated, and uncovered like space, abiding in that meditative stability, one acquires the state in which all phenomena are unattached, liberated, and uncovered like space.

source: འདི་ནི་ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་པས། རྣམ་པར་གྲོལ་ཞིང་གོས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏེ།
en: This is the meditative stability named unattached, liberated, and uncovered like space. “

source: རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཐེག་པ་ཆེན་པོའོ།
en: This, Subhūti, is the Great Vehicle of bodhisattva great beings who practice the perfection of wisdom.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་བརྒྱད་པའོ།། །།
en: This completes the eighth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”
